Repository: fatrixmpj/TYPO3D
Catalog: typo3conf/l10n/*/t3jquery/mod1/*.locallang.xlf
Languages: de

# title
source: jQuery Setup
de: jQuery-Konfiguration

# version_in_use
source: Versions in use: %s
de: Version im Einsatz: %s

# integrate_from_cdn
source: You are using CDN to integrate the jQuery-Libs, there are no further settings.
de: Sie nutzen CDN zur Integration der jQuery-Bibliothek, es gibt keine weiteren Einstellungen.

# function1
source: Create custom jQuery JS library
de: Erstellung einer individuellen jQuery-JS-Bibliothek

# function2
source: Analyze .js for jQuery dependencies
de: JS-Analyse auf jQuery-Abhängigkeiten

# function3
source: Process & Analyze t3jquery.txt in extensions
de: JS-Analyse von t3jquery.txt in Extensions

# function4
source: Compress your own javascript file
de: Komprimieren eigener JS-Dateien

# function5
source: Display class.t3jquery.php API
de: Anzeige der class.t3jquery.php-API

# jquery.analyze.dependencies
source: jQuery dependencies found in file:
de: jQuery-Abhängigkeiten in folgender Datei:

# jquery.analyze.none
source: None
de: Keine

# jquery.analyze.packed
source: File is either not ending in .js or file is compressed with Packer!
de: Datei endet nicht auf .js oder ist bereits komprimiert!

# jquery.button.check
source: Check
de: Analysieren

# jquery.button.compress
source: Compress
de: Komprimieren

# jquery.button.create
source: Create jQuery Library
de: jQuery-Bibliothek erstellen

# jquery.button.mergejq
source: Merge & Use
de: Vereinigen & Benützen

# jquery.button.selectall
source: Select all
de: Alles auswählen

# jquery.button.selectnone
source: Deselect all
de: Auswahl löschen

# jquery.button.usejq
source: Use
de: Benützen

# jquery.compress.compress
source: Paste in your UNCOMPRESSED javascript into this field:
de: Hier das <em>unkomprimierte</em> JavaScript einfügen:

# jquery.compress.decompress
source: A COMPRESSED version of your javascript will appear in this field.
de: Die <em>komprimierte</em> Version:

# jquery.compress.description
source: This module can be used for compressing your own javascript file(s), using the same compression (Packer or JsMin) used for compressing the jQuery library.
de: Durch dieses Modul wird die Möglichkeit zur Verfügung gestellt, eigene JavaScript-Dateien zu komprimieren. Verwendet wird <a href="http://joliclic.free.fr/php/javascript-packer/en/" target="_blank">die PHP5-version</a> von <a href="http://dean.edwards.name/packer/" target="_blank">Dean Edwards Packer</a> oder <a href="http://www.crockford.com/javascript/jsmin.html" target="_blank">JSMin</a>.

# jquery.compress.nomunge
source: Minify only:
de: Nur verkleinern:

# jquery.compress.nomunge.yes
source: Yes
de: Ja

# jquery.compress.nomunge.no
source: No
de: Nein

# jquery.compression
source: Choose compression type
de: Kompressionsstufe auswählen

# jquery.compression.jsmin.description
source: Cleans comments and whitespace, Compression by <a href="http://www.crockford.com/javascript/jsmin.html">JSMin</a>.
de: Säubert Kommentare und Leerzeichen, Kompression mit <a href="http://www.crockford.com/javascript/jsmin.html" target="_blank">JSMin</a>.

# jquery.compression.jsmin.name
source: JsMin Compression
de: JsMin-Komprimierung

# jquery.compression.nodocs.description
source: Uncompressed, removes only documentation
de: Unkomprimiert, löscht lediglich die Dokumentation.

# jquery.compression.nodocs.name
source: No Documentation
de: Ohne Dokumentation

# jquery.compression.none.description
source: Full Source, includes documentation. Recommended while testing & building.
de: Unkomprimiert, inklusive Dokumentation. Empfehlenswert während der Entwicklung.

# jquery.compression.none.name
source: No Compression
de: Keine Komprimierung

# jquery.compression.packer.description
source: Uses <a href="http://joliclic.free.fr/php/javascript-packer/en/" target="_blank">the php5 version</a> of <a href="http://dean.edwards.name/packer/" target="_blank">Dean Edwards Packer</a>.
de: Verwendet <a href="http://joliclic.free.fr/php/javascript-packer/en/" target="_blank">die PHP5-Version</a> von <a href="http://dean.edwards.name/packer/" target="_blank">Dean Edwards Packer</a>.

# jquery.compression.packer.name
source: Packer Compression
de: Packer-Komprimierung

# jquery.extension.dependencies
source: jQuery dependencies found selected extensions:
de: jQuery-Abhängikeiten in den Extenions gefunden:

# jquery.extension.description
source: Select the extensions you want processed and checked for jQuery dependencies.
de: Extensions auswählen, die auf jQuery-Abhängigkeiten geprüft werden sollen.

# jquery.extension.title
source: Title:
de: Titel:

# jquery.header1
source: Choose the jQuery Components you need:
de: Benötigte Komponenten auswählen:

# jquery.header2
source: Find the jQuery Components you need
de: Benötigten Komponenten finden

# jquery.header3
source: Find the jQuery Components you need
de: Vorhandene Extensions analysieren

# jquery.header4
source: Compress your own javascript file
de: Komprimieren eigener JS-Dateien

# jquery.header5
source: Display class.t3jquery.php API
de: Anzeige der class.t3jquery.php-API

# jquery.packito.description
source: Select the uncompressed Javascript file you want to check for jQuery dependencies.
de: Unkomprimiertes JavaScript auswählen, das auf jQuery-Abhängigkeiten geprüft werden soll.

# jquery.packito.local
source: or Local file:
de: oder lokale Datei:

# jquery.packito.note
source: <em>Note: Only files with the extension <strong>.js</strong> is accepted.<br /> Local extension dirs can be accessed using EXT:. ie. EXT:t3jquery/res/jqconfig.js</em>
de: <em>Achtung: Nur Dateien mit <strong>.js</strong> werden akzeptiert.<br /> Extension-Verzeichnisse können mit EXT: abgerufen werden. zB. EXT:t3jquery/res/jqconfig.js</em>

# jquery.packito.remote
source: Remote file:
de: Datei am Server:

# jquery.component.jquery
source: The jQuery, required for UI Core.
de: jQuery, für UI-Kern erforderlich.

# jquery.component.noConflict
source: Activates the noConflict mode of jQuery to work with other JS-Frameworks
de: Aktiviert den noConflict-Modus für jQuery, damit Sie auch mit anderen JS-Frameworks arbeiten können.

# jquery.component.uicore
source: The core of jQuery UI, required for all interactions and widgets.
de: Die Basis des jQuery-UI. Erforderlich für alle Interaktionen und Widgets.

# jquery.component.widget
source: Core utility for building UI controls.
de: Widget, für alle Widgets erforderlich.

# jquery.component.mouse
source: Track and handle mouse-based interactions.
de: Mouse, für alle Interaktionen mit der Maus erforderlich.

# jquery.component.position
source: Place elements at specific locations in relation to other elements.
de: Plaziert Elemente an einer bestimmten Stelle in Relation zu anderen Elementen.

# jquery.component.draggable
source: Allow elements to be moved using the mouse.
de: Macht alle Elemente einer Seite ziehbar.

# jquery.component.droppable
source: Create targets for draggable elements.
de: Generierte Ziele für ziehbare Elemente.

# jquery.component.resizable
source: Change the size of an element using the mouse.
de: Macht alle Elemente einer Seite in der Größe veränderbar.

# jquery.component.selectable
source: Use the mouse to select elements, individually or in a group.
de: Macht eine Liste mit Elementen durch die Maus auswählbar, indem man einen Rahmen aufzieht oder darauf klickt.

# jquery.component.sortable
source: Reorder elements in a list or grid using the mouse.
de: Macht eine Liste mit Einträgen sortierbar.

# jquery.component.accordion
source: Displays collapsible content panels for presenting information in a limited amount of space.
de: Erzeugt ein Akkordeon-Navigationswidget.

# jquery.component.autocomplete
source: Enables users to quickly find and select from a pre-populated list of values as they type, leveraging searching and filtering.
de: Auto-Vervollständigung ermöglicht es Benutzern, während der Eingabe schnell aus einer Liste vordefinierter Werte zu wählen, wenn sie zu einem Eingabefeld hinzugefügt wird. Das erleichtert Suchen und Filtern.

# jquery.component.dialog
source: Open content in an interactive overlay.
de: Öffnet vorhandenes Markup in einem ziehbaren und in der Größe veränderbaren Dialog.

# jquery.component.slider
source: Drag a handle to select a numeric value.
de: Ein flexible Regler mit Begrenzungen auf dem mit der Tastatur zugegriffen werden kann.

# jquery.component.tabs
source: A single content area with multiple panels, each associated with a header in a list.
de: Transformiert ein Set mit Containerelementen in eine Tabstruktur.

# jquery.component.datepicker
source: Select a date from a popup or inline calendar.
de: Eine Datumsauswahl, die aus einer Eingabe heraus aktiviert werden kann oder angezeigt werden kann.

# jquery.component.progressbar
source: Display status of a determinate or indeterminate process.
de: Ein Statusindikator. Er kann für den Ladefortschritt oder als Prozentindikator benutzt werden.

# jquery.component.effects.core
source: Extends the internal jQuery effects, includes morphing, easing and is required by all other effects.
de: Erweitert die internen jQuery-Effekte, beinhaltet Morphing, Easng und wird von allen anderen Effekten benötigt.

# jquery.component.effects.blind
source: Blinds the element.
de: Blendet das Element aus.

# jquery.component.effects.bounce
source: Bounces an element horizontally or vertically n-times.
de: Das Element hüpft n-mal horizontal oder vertikal.

# jquery.component.effects.clip
source: Clips the element on and off like an old TV.
de: Schaltet ein Element, wie einen alten Fernsehr, an und aus.

# jquery.component.effects.drop
source: A Drop out effect by moving the element in one direction and hiding it at the same time.
de: Ein Ausblend-Effekt, bei dem das Element in eine Richtung bewegt und gleichzeitig versteckt wird.

# jquery.component.effects.explode
source: The element explodes in all directions into n pieces. Also supports imploding again.
de: Das Element explodiert nach allen Richtungen in n Stücken. Es kann auch wieder implodieren.

# jquery.component.effects.fade
source: The element will fades in or out.
de: Das Element wird ein- oder ausgeblendet.

# jquery.component.effects.fold
source: Folds the element first horizontally and then vertically.
de: Faltet das Element erst horizontal und dann vertikal.

# jquery.component.effects.highlight
source: Highlights the background of the element in a defined color for a custom duration.
de: Hebt den Hintergrund des Elements in einer definierten Farbe für eine bestimmte Zeit hervor.

# jquery.component.effects.pulsate
source: The element pulsates n times by changing the opacity to zero and back.
de: Das Element pulsiert n-mal durch Veränderung der Transparenz.

# jquery.component.effects.scale
source: Grow or shrink any element and it's content and restore it again.
de: Beliebige Elemente und ihren Inhalt wachsen oder schrumpfen lassen und wiederherstellen.

# jquery.component.effects.shake
source: Shakes the element horizontally or vertically n times.
de: Bewegt das Element n-mal horizontal oder vertikal hin und her (Schütteleffekt).

# jquery.component.effects.slide
source: The element slides in and out of the viewport.
de: Das Element wird in den sichtbaren Fensterbereich hinein und heraus bewegt.

# jquery.component.effects.transfer
source: Transfer effect from one element to another.
de: Übergangseffekt von einem Element zu einem anderen.

# tools.component.tabs
source: The most important UI widget on the web
de: Das wichtigste UI Widget im Netz

# tools.component.tabsslideshow
source: Transforms tabs into a working slideshow
de: Verwandelt Tabs in eine funktionierende Diashow

# tools.component.tooltip
source: The second most important UI widget on the web.
de: Das zweitwichtigste UI Widget im Netz

# tools.component.tooltipdynamic
source: Dynamic positioning of the tooltip so that it always stays in the viewport
de: Dynamische Positionierung des Tooltips, so dass es immer innerhalb des sichtbaren Bereichs bleibt

# tools.component.formdateinput
source: HTML5 date input for humans
de: HTML5 Datumseingabe für Menschen

# tools.component.formrangeinput
source: HTML5 range input for humans
de: HTML5 Bereichseingabe für Menschen

# tools.component.formvalidator
source: HTML5 input validation for humans
de: HTML5 Eingabevalidierung für Menschen

# tools.component.history
source: Back button for AJAX apps
de: Zurück Schaltfläche für AJAX Anwendungen

# tools.component.mousewheel
source: A generic mousewheel support for jQuery
de: Eine standard Mausrad-Unterstützung für jQuery

# tools.component.flowplayer
source: The JavaScript component of Flowplayer - the Video player for the Web
de: Die Javascript Komponente des Flowplayers - Der VideoPlayer fürs Netz

# tools.component.flowplayercontrolbar
source: Generate video controls with HTML and CSS
de: Erzeuge Video-Bedienelemente mit HTML und CSS

# tools.component.flowplayerplaylist
source: Generate video playlists with HTML and CSS
de: Erzeuge Video Spiellisten mit HTML und CSS
