Repository: fatrixmpj/TYPO3D
Catalog: typo3conf/ext/go_maps_ext/Resources/Private/Language/*.locallang_db.xlf
Languages: de

# sys_category.tab.map
source: Google Map
de: Google Karte

# tx_gomapsext_domain_model_address
source: Google Maps Address
de: Google Maps Adresse

# tx_gomapsext_domain_model_address.address
source: Address
de: Adresse

# tx_gomapsext_domain_model_address.categories
source: Categories
de: Kategorien

# tx_gomapsext_domain_model_address.close_by_click
source: Close InfoWindow by click
de: Mit Klicken schließen

# tx_gomapsext_domain_model_address.image_height
source: Image height (px)
de: Bildhöhe (px)

# tx_gomapsext_domain_model_address.image_size
source: User defined image size
de: Benutzerdefinierte Bildgröße

# tx_gomapsext_domain_model_address.image_width
source: Image width (px)
de: Bildbreite (px)

# tx_gomapsext_domain_model_address.info_window
source: InfoWindow
de: Info-Fenster

# tx_gomapsext_domain_model_address.info_window_content
source: InfoWindow content
de: Inhalt des Info-Fensters

# tx_gomapsext_domain_model_address.info_window_images
source: InfoWindow image
de: Info-Fenster Bild

# tx_gomapsext_domain_model_address.info_window_link
source: Link to Google Maps
de: Link zu Google Maps

# tx_gomapsext_domain_model_address.info_window_link.0
source: No
de: Nein

# tx_gomapsext_domain_model_address.info_window_link.1
source: With address (and title)
de: Mit Adresse (und Titel)

# tx_gomapsext_domain_model_address.info_window_link.2
source: With coordinates (and title)
de: Mit Koordinaten (und Titel)

# tx_gomapsext_domain_model_address.open_by_click
source: Open InfoWindow by click
de: Mit Klicken öffnen

# tx_gomapsext_domain_model_address.opened
source: Opened
de: Geöffnet

# tx_gomapsext_domain_model_address.others
source: Others
de: Sonstiges

# tx_gomapsext_domain_model_address.palettes.interaction
source: Interaction
de: Interaktion

# tx_gomapsext_domain_model_address.palettes.marker
source: Marker layout
de: Marker Aussehen

# tx_gomapsext_domain_model_address.style
source: Style
de: Aussehen

# tx_gomapsext_domain_model_address.title
source: Title
de: Titel

# tx_gomapsext_domain_model_category
source: Category
de: Kategorie

# tx_gomapsext_domain_model_map
source: Map
de: Karte

# tx_gomapsext_domain_model_map.addresses
source: Addresses
de: Adressen

# tx_gomapsext_domain_model_map.calc_route
source: Calc route form
de: Route berechnen Formular

# tx_gomapsext_domain_model_map.class
source: Class
de: Klasse

# tx_gomapsext_domain_model_map.default_type
source: Default type
de: Kartentyp am Anfang

# tx_gomapsext_domain_model_map.display.default.0
source: Map
de: Karte

# tx_gomapsext_domain_model_map.display.default.1
source: Satellite
de: Satellit

# tx_gomapsext_domain_model_map.display.default.2
source: Hybrid
de: Satellit mit Beschriftung

# tx_gomapsext_domain_model_map.display.default.4
source: Styled (Only if styled Map is defined!)
de: Styled Map (Nur wenn definiert!)

# tx_gomapsext_domain_model_map.double_click_zoom
source: Doubleclick zoom
de: Doppelklick-Zoom

# tx_gomapsext_domain_model_map.draggable
source: Draggable
de: Verschiebbare Karte

# tx_gomapsext_domain_model_map.height
source: Height
de: Höhe

# tx_gomapsext_domain_model_map.kml_local
source: KML file location is local
de: lokale KML-Datei

# tx_gomapsext_domain_model_map.kml_preserve_viewport
source: Preserve Viewport
de: Gebiet der Karte bewahren

# tx_gomapsext_domain_model_map.kml_url
source: URL of a KML file
de: URL einer KML Datei

# tx_gomapsext_domain_model_map.latitude
source: Latitude
de: Breitengrad

# tx_gomapsext_domain_model_map.longitude
source: Longitude
de: Längengrad

# tx_gomapsext_domain_model_map.map_type_control
source: Map type control
de: Zeige Kartentyp-Steuerung

# tx_gomapsext_domain_model_map.map_types
source: Map types
de: Mögliche Kartentypen

# tx_gomapsext_domain_model_map.map_types.0
source: Map
de: Karte

# tx_gomapsext_domain_model_map.map_types.1
source: Satellite
de: Satellit

# tx_gomapsext_domain_model_map.map_types.2
source: Hybrid
de: Satellit mit Beschriftungen

# tx_gomapsext_domain_model_map.marker_cluster_size
source: Cluster size
de: Cluster Größe

# tx_gomapsext_domain_model_map.marker_search
source: Marker Search
de: Marker Suche

# tx_gomapsext_domain_model_map.palettes.additional
source: Additional
de: Zusätzliches

# tx_gomapsext_domain_model_map.palettes.address_interaction
source: Address Interaction
de: Interaktionen Adressen

# tx_gomapsext_domain_model_map.palettes.cluster
source: Cluster settings
de: Cluster Einstellungen

# tx_gomapsext_domain_model_map.palettes.coordinates
source: Default map center
de: Standard Kartenausschnitt

# tx_gomapsext_domain_model_map.palettes.interaction
source: Map Interaction
de: Interaktionen Karte

# tx_gomapsext_domain_model_map.palettes.kml
source: KML settings
de: KML Einstellungen

# tx_gomapsext_domain_model_map.palettes.size
source: Size
de: Maße

# tx_gomapsext_domain_model_map.palettes.zoom
source: Zoom settings
de: Zoom Einstellungen

# tx_gomapsext_domain_model_map.pan_control
source: Pan control
de: Zeige Schwenksteuerung

# tx_gomapsext_domain_model_map.scale_control
source: Scale control
de: Zeige Maßstab

# tx_gomapsext_domain_model_map.show_addresses
source: Show Address Links
de: Zeige Adressen-Links

# tx_gomapsext_domain_model_map.show_categories
source: Show Categories
de: Zeige Kategorieauswahl

# tx_gomapsext_domain_model_map.show_route
source: Show particular route
de: Bestimmte Route anzeigen

# tx_gomapsext_domain_model_map.streetview_control
source: Streetview control
de: Zeige StreetView-Steuerung

# tx_gomapsext_domain_model_map.styled_map_name
source: Styled Map name
de: Name der benutzerdefierten Karte

# tx_gomapsext_domain_model_map.tab.controls
source: Controls
de: Steuerung

# tx_gomapsext_domain_model_map.tab.display
source: Display
de: Anzeige

# tx_gomapsext_domain_model_map.tab.others
source: Record
de: Datensatz

# tx_gomapsext_domain_model_map.title
source: Title
de: Titel

# tx_gomapsext_domain_model_map.tooltip_title
source: Tooltip title
de: Tooltip-Titel

# tx_gomapsext_domain_model_map.travel_mode
source: Travel mode
de: Reise Modi

# tx_gomapsext_domain_model_map.travel_mode.0
source: Driving
de: Auto

# tx_gomapsext_domain_model_map.travel_mode.1
source: Select by frontend user
de: Frontend Auswahl

# tx_gomapsext_domain_model_map.travel_mode.2
source: Bicycling (only available in US)
de: Fahrrad (derzeit nur in USA)

# tx_gomapsext_domain_model_map.travel_mode.3
source: Transit
de: Öffentliche Verkehrsmittel

# tx_gomapsext_domain_model_map.travel_mode.4
source: Walking
de: Zu Fuß

# tx_gomapsext_domain_model_map.unit_system
source: Unit system
de: Einheiten

# tx_gomapsext_domain_model_map.unit_system.0
source: Default
de: Standard

# tx_gomapsext_domain_model_map.unit_system.1
source: Select by frontend user
de: Frontend Auswahl

# tx_gomapsext_domain_model_map.unit_system.2
source: Metric (kilometer)
de: Metrisch (Kilometer)

# tx_gomapsext_domain_model_map.unit_system.3
source: Imperial (miles)
de: Imperial (Meilen)

# tx_gomapsext_domain_model_map.width
source: Width
de: Breite

# tx_gomapsext_domain_model_map.zoom_control
source: Zoom control
de: Zeige Zoom-Steuerung

# tx_gomapsext_domain_model_map.zoom_control_type
source: Type of zoom control
de: Typ der Zoom-Steuerung

# tx_gomapsext_domain_model_map.zoom_control_type.0
source: Default (according to map size)
de: Standard (Abhängig von Kartengröße)

# tx_gomapsext_domain_model_map.zoom_control_type.1
source: Small (only 2 zoom buttons)
de: Klein (Nur zwei Buttons)

# tx_gomapsext_domain_model_map.zoom_control_type.2
source: Large (zoom-scale and buttons)
de: Groß (Skala and Buttons)
